#!/bin/bash


pc(){
  curl -X POST http://localhost:17000 -d "$1" 
}

pc "reset"
pc "white"
pc "bgrect 0.25 0.25 0.75 0.75"
pc "figure 0.5 0.5"
pc "green"
pc "figure 0.6 0.6"
# Щоб фігура не виходила за рамки чорного фону,
# потрібно розкоментувати команду снизу
# pc "bgrect 200 200 685 685"
pc "update"

# Фігура відображається без проміжку с зеленим фоном
# через те, що сама фігура займає 400px, тобто
# пів єкрану. Чорний фон у нас теж пів єкрану
# с 0.25 по 0.75, тобто різниця 0.5 
# Щоб фігура займала трохи менше ніж фон, потрібно
# змінити bgrect 0.25 0.25 0.75 0.75
# на 0.2 0.2 0.8 0.8
